#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my-terraform-aws-projects-2025/aws-terraform-cloud-dictionary/runs/run-A2DAfmjctAQ1hvTH

Waiting for the plan to start...

Terraform v1.14.3
on linux_amd64
Initializing plugins and modules...
module.lambda.data.archive_file.lambda_zip: Reading...
module.lambda.data.archive_file.lambda_zip: Read complete after 0s [id=808c13d893fbfdb2a60b23924bce0395771674c6]
module.lambda.aws_sqs_queue.lambda_dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/871308866502/CloudDictionary-DLQ]
aws_iam_role.api_gateway_logging: Refreshing state... [id=APIGatewayCloudWatchLogsRole]
module.lambda.aws_iam_role.lambda_exec_role: Refreshing state... [id=cloud_dictionary_lambda_role]
module.database.aws_dynamodb_table.dictionary_table: Refreshing state... [id=CloudDictionary]
module.database.aws_dynamodb_table_item.dictionary_items["SageMaker"]: Refreshing state... [id=CloudDictionary|Term|SAGEMAKER]
module.database.aws_dynamodb_table_item.dictionary_items["Redshift"]: Refreshing state... [id=CloudDictionary|Term|REDSHIFT]
module.database.aws_dynamodb_table_item.dictionary_items["Internet Gateway"]: Refreshing state... [id=CloudDictionary|Term|INTERNET GATEWAY]
module.database.aws_dynamodb_table_item.dictionary_items["VPC"]: Refreshing state... [id=CloudDictionary|Term|VPC]
module.database.aws_dynamodb_table_item.dictionary_items["Glacier"]: Refreshing state... [id=CloudDictionary|Term|GLACIER]
module.database.aws_dynamodb_table_item.dictionary_items["Route 53"]: Refreshing state... [id=CloudDictionary|Term|ROUTE 53]
module.database.aws_dynamodb_table_item.dictionary_items["CodePipeline"]: Refreshing state... [id=CloudDictionary|Term|CODEPIPELINE]
module.database.aws_dynamodb_table_item.dictionary_items["Step Functions"]: Refreshing state... [id=CloudDictionary|Term|STEP FUNCTIONS]
module.database.aws_dynamodb_table_item.dictionary_items["Lambda"]: Refreshing state... [id=CloudDictionary|Term|LAMBDA]
module.database.aws_dynamodb_table_item.dictionary_items["Kinesis"]: Refreshing state... [id=CloudDictionary|Term|KINESIS]
module.database.aws_dynamodb_table_item.dictionary_items["CloudFormation"]: Refreshing state... [id=CloudDictionary|Term|CLOUDFORMATION]
module.database.aws_dynamodb_table_item.dictionary_items["CloudWatch"]: Refreshing state... [id=CloudDictionary|Term|CLOUDWATCH]
module.database.aws_dynamodb_table_item.dictionary_items["SNS"]: Refreshing state... [id=CloudDictionary|Term|SNS]
module.database.aws_dynamodb_table_item.dictionary_items["EBS"]: Refreshing state... [id=CloudDictionary|Term|EBS]
module.database.aws_dynamodb_table_item.dictionary_items["Route Table"]: Refreshing state... [id=CloudDictionary|Term|ROUTE TABLE]
module.database.aws_dynamodb_table_item.dictionary_items["IAM"]: Refreshing state... [id=CloudDictionary|Term|IAM]
module.database.aws_dynamodb_table_item.dictionary_items["RDS"]: Refreshing state... [id=CloudDictionary|Term|RDS]
module.database.aws_dynamodb_table_item.dictionary_items["S3"]: Refreshing state... [id=CloudDictionary|Term|S3]
module.database.aws_dynamodb_table_item.dictionary_items["EFS"]: Refreshing state... [id=CloudDictionary|Term|EFS]
module.database.aws_dynamodb_table_item.dictionary_items["DynamoDB"]: Refreshing state... [id=CloudDictionary|Term|DYNAMODB]
module.database.aws_dynamodb_table_item.dictionary_items["Fargate"]: Refreshing state... [id=CloudDictionary|Term|FARGATE]
module.database.aws_dynamodb_table_item.dictionary_items["EC2"]: Refreshing state... [id=CloudDictionary|Term|EC2]
module.database.aws_dynamodb_table_item.dictionary_items["CloudFront"]: Refreshing state... [id=CloudDictionary|Term|CLOUDFRONT]
module.database.aws_dynamodb_table_item.dictionary_items["Elastic Beanstalk"]: Refreshing state... [id=CloudDictionary|Term|ELASTIC BEANSTALK]
module.database.aws_dynamodb_table_item.dictionary_items["Elastic IP"]: Refreshing state... [id=CloudDictionary|Term|ELASTIC IP]
module.database.aws_dynamodb_table_item.dictionary_items["CloudTrail"]: Refreshing state... [id=CloudDictionary|Term|CLOUDTRAIL]
module.database.aws_dynamodb_table_item.dictionary_items["API Gateway"]: Refreshing state... [id=CloudDictionary|Term|API GATEWAY]
module.database.aws_dynamodb_table_item.dictionary_items["Auto Scaling"]: Refreshing state... [id=CloudDictionary|Term|AUTO SCALING]
module.database.aws_dynamodb_table_item.dictionary_items["NAT Gateway"]: Refreshing state... [id=CloudDictionary|Term|NAT GATEWAY]
module.database.aws_dynamodb_table_item.dictionary_items["SQS"]: Refreshing state... [id=CloudDictionary|Term|SQS]
aws_iam_role_policy_attachment.api_gateway_logging: Refreshing state... [id=APIGatewayCloudWatchLogsRole-20260202120047168800000001]
module.lambda.aws_iam_role_policy.lambda_sqs_policy: Refreshing state... [id=cloud_dictionary_lambda_role:LambdaDLQPolicy]
aws_api_gateway_account.main: Refreshing state... [id=api-gateway-account]
module.lambda.aws_iam_role_policy.lambda_dynamo_policy: Refreshing state... [id=cloud_dictionary_lambda_role:terraform-20260202120058877200000002]
module.lambda.aws_lambda_function.dictionary_handler: Refreshing state... [id=CloudDictionaryHandler]
module.api.aws_api_gateway_rest_api.dictionary_api: Refreshing state... [id=blc58ozxp0]
module.api.aws_api_gateway_resource.search: Refreshing state... [id=5e2y3y]
module.api.aws_api_gateway_request_validator.dictionary_validator: Refreshing state... [id=2e08ls]
module.lambda.aws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/CloudDictionaryHandler]
module.api.aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api.aws_api_gateway_method.get_term: Refreshing state... [id=agm-blc58ozxp0-5e2y3y-GET]
module.api.aws_api_gateway_integration.lambda_integration: Refreshing state... [id=agi-blc58ozxp0-5e2y3y-GET]
module.lambda.aws_iam_role_policy.lambda_logging: Refreshing state... [id=cloud_dictionary_lambda_role:lambda_logging_policy]
module.api.aws_api_gateway_deployment.prod: Refreshing state... [id=4u7pa8]
module.api.aws_api_gateway_stage.prod: Refreshing state... [id=ags-blc58ozxp0-prod]
module.api.aws_api_gateway_method_settings.all: Refreshing state... [id=blc58ozxp0-prod-*/*]
module.app.aws_amplify_app.dictionary_frontend: Refreshing state... [id=dv7m59146nc9a]
module.app.aws_amplify_branch.main: Refreshing state... [id=dv7m59146nc9a/main]
module.app.aws_amplify_webhook.build_webhook: Refreshing state... [id=3e19e6f1-0642-47ca-8712-3ba1a03d6162]
module.app.null_resource.curl_webhook: Refreshing state... [id=4402172005750925822]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.api.aws_api_gateway_integration.lambda_integration has changed
  ~ resource "aws_api_gateway_integration" "lambda_integration" {
      + cache_key_parameters    = []
        id                      = "agi-blc58ozxp0-5e2y3y-GET"
      + request_parameters      = {}
      + request_templates       = {}
        # (13 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.api.aws_api_gateway_deployment.prod must be replaced
+/- resource "aws_api_gateway_deployment" "prod" {
      ~ created_date  = "2026-02-02T12:32:15Z" -> (known after apply)
      ~ description   = "Deployed via Terraform on 2026-02-02T12:32:14Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:871308866502:blc58ozxp0/" -> (known after apply)
      ~ id            = "4u7pa8" -> (known after apply)
      ~ invoke_url    = "https://blc58ozxp0.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "a48be255843d5721e9e192ccc1ddca8be6dae868" -> "9880c8bd5fbabe94c3a0d2098d4051af1aada8c7"
        }
        # (1 unchanged attribute hidden)
    }

  # module.api.aws_api_gateway_stage.prod will be updated in-place
  ~ resource "aws_api_gateway_stage" "prod" {
      ~ deployment_id         = "4u7pa8" -> (known after apply)
        id                    = "ags-blc58ozxp0-prod"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

  # module.app.aws_amplify_app.dictionary_frontend will be updated in-place
  ~ resource "aws_amplify_app" "dictionary_frontend" {
      ~ auto_branch_creation_patterns = [
          - "*",
          - "*/**",
        ]
        id                            = "dv7m59146nc9a"
        name                          = "cloud-dictionary-app"
        tags                          = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.app.null_resource.curl_webhook must be replaced
-/+ resource "null_resource" "curl_webhook" {
      ~ id       = "4402172005750925822" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "always_run" = "2026-02-02T12:32:19Z" -> (known after apply)
            # (1 unchanged element hidden)
        }
    }

Plan: 2 to add, 2 to change, 2 to destroy.

------------------------------------------------------------------------

Cost estimation:

Resources: 0 of 9 estimated
           $0.0/mo +$0.0

```

</details>